Assignment2/rails-intro/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || Hash[@all_ratings.collect { |r| [r, r] }]
---
SELECT "movies".* FROM "movies" ORDER BY release_date